In [1]:
import pandas as pd
import io
orig= pd.read_csv(io.StringIO("""year,post,type,price
2009,00100,1,4817
2009,00100,2,4470
2009,00100,3,4234"""),dtype={'post':str})
orig

   year   post  type  price
0  2009  00100     1   4817
1  2009  00100     2   4470
2  2009  00100     3   4234

In [9]:
df=(orig
   .assign(indices=(orig.iloc[:,:3].apply(tuple,axis='columns')))
   .drop(columns=['year','post','type'])
)
df

0    (2009, 00100, 1)
1    (2009, 00100, 2)
2    (2009, 00100, 3)
Name: indices, dtype: object

In [7]:
(df
 .assign(**pd.DataFrame(df.indices.to_list(),columns=['year','postcode','type']))
 .drop(columns='indices')
)

   price  year postcode  type
0   4817  2009    00100     1
1   4470  2009    00100     2
2   4234  2009    00100     3